# 4.6 Combining and Exporting Data

In [ ]:
This script contains the following points:
1. Merging test data 
2. Importing orders and prior_orders data
3. Merging orders and prior_orders data

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Define a dictionary containing January 2020 data

data_0120 = {'customer_id':['6732','767','890','635'],
            'month':['Jan-20','Jan-20','Jan-20','Jan-20'],
            'purchased_meat':[0,13,3,4],
            'purchased_alcohol':[1,2,10,0],
            'purchased_snacks':[10,5,1,7]}

In [3]:
# Define a dictionary containing February 2020 data

data_0220 = {'customer_id':['6732','767','890','635'],
            'month':['Feb-20','Feb-20','Feb-20','Feb-20'],
            'purchased_meat':[0,10,5,3],
            'purchased_alcohol':[2,4,14,0],
            'purchased_snacks':[15,3,2,6]}

In [4]:
# Convert the dictionaries into DataFrame
df_0120 = pd.DataFrame(data_0120,index=[0,1,2,3])
df_0220 = pd.DataFrame(data_0220,index=[0,1,2,3])

In [5]:
df_0120

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7

In [6]:
df_0220

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [7]:
# Create a list for January 2020 and February 2020 dataframes

frames = [df_0120,df_0220]

In [8]:
# Check frames output

frames

[  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
 0        6732  Jan-20               0                  1                10
 1         767  Jan-20              13                  2                 5
 2         890  Jan-20               3                 10                 1
 3         635  Jan-20               4                  0                 7,
   customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
 0        6732  Feb-20               0                  2                15
 1         767  Feb-20              10                  4                 3
 2         890  Feb-20               5                 14                 2
 3         635  Feb-20               3                  0                 6]

In [9]:
# Concatenate the dataframes

df_concat = pd.concat(frames)

In [10]:
df_concat

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [11]:
# Concatenate the dataframes to a wide format

df_concat_wide =pd.concat(frames,axis = 1)

In [12]:
df_concat_wide

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks
0,6732,Jan-20,0,1,10,6732,Feb-20,0,2,15
1,767,Jan-20,13,2,5,767,Feb-20,10,4,3
2,890,Jan-20,3,10,1,890,Feb-20,5,14,2
3,635,Jan-20,4,0,7,635,Feb-20,3,0,6

In [13]:
# Append February 2020 data

df_appended = df_0120.append(df_0220)

C:\Users\dell\AppData\Local\Temp\ipykernel_3648\408874961.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_appended = df_0120.append(df_0220)

In [14]:
df_appended

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [15]:
# Create data with different columns from dataframe

data_ap = {'customer_id':['6732', '767', '890', '635'], 
        'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'], 
        'days_purchased_on':[0, 13, 3, 4]}

In [16]:
df_ap = pd.DataFrame(data_ap,index=[0,1,2,3])

In [17]:
df_ap

  customer_id   month  days_purchased_on
0        6732  Jan-20                  0
1         767  Jan-20                 13
2         890  Jan-20                  3
3         635  Jan-20                  4

In [18]:
# Merge January 2020 and Appended dataframes using customer_id

df_merged = df_0120.merge(df_ap, on = 'customer_id')

In [19]:
df_merged

,customer_id,month_x,purchased_meat,purchased_alcohol,purchased_snacks,month_y,days_purchased_on
0,6732,Jan-20,0,1,10,Jan-20,0
1,767,Jan-20,13,2,5,Jan-20,13
2,890,Jan-20,3,10,1,Jan-20,3
3,635,Jan-20,4,0,7,Jan-20,4

In [20]:
# Merge January 2020 and Appended dataframes using customer_id with indicator

df_merge_ind=pd.merge(df_0120,df_ap, on = 'customer_id',indicator = True)

In [21]:
df_merge_ind

,customer_id,month_x,purchased_meat,purchased_alcohol,purchased_snacks,month_y,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,Jan-20,0,both
1,767,Jan-20,13,2,5,Jan-20,13,both
2,890,Jan-20,3,10,1,Jan-20,3,both
3,635,Jan-20,4,0,7,Jan-20,4,both

In [22]:
# Frequency check on df_merged

df_merge_ind['_merge'].value_counts()

both          4
left_only     0
right_only    0
Name: _merge, dtype: int64

# Merging Instacart Data

In [23]:
path=r'C:\Users\dell\Desktop\Career Foundry\0423_Instacart Analysis'

In [24]:
# Import data set order_products_prior.csv
df_orders_prior=pd.read_csv(os.path.join(path,'02 Data','Original Data','order_products__prior.csv'),index_col=False)

In [25]:
# Check df_orders_prior output

df_orders_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [26]:
vars_list=['order_id','user_id','order_number','orders_day_of_week','order_hour_of_day','#ofdays_since_last_order']

In [27]:
#Import data set orders_checked.csv
df_orders=pd.read_csv(os.path.join(path,'02 Data','Prepared Data','orders_checked.csv'),usecols=vars_list)

In [28]:
# Check df_orders output

df_orders.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,#ofdays_since_last_order
0,2539329,1,1,2,8,0.0
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [29]:
# Shape check of df_orders_prior

df_orders_prior.shape

(32434489, 4)

In [30]:
# Shape check of df_orders

df_orders.shape

(3421083, 6)

In [31]:
# Merge of orders and orders_prior based of order_id... wish me luck!

df_merged_large = df_orders.merge(df_orders_prior, on = 'order_id', indicator = True)

In [32]:
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,#ofdays_since_last_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,0.0,196,1,0,both
1,2539329,1,1,2,8,0.0,14084,2,0,both
2,2539329,1,1,2,8,0.0,12427,3,0,both
3,2539329,1,1,2,8,0.0,26088,4,0,both
4,2539329,1,1,2,8,0.0,26405,5,0,both

In [33]:
df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

In [34]:
# Final merge without indicator for export

df_merged_large = df_orders.merge(df_orders_prior, on = 'order_id')

In [35]:
# Export data to pkl

df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))